paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_207_drv.c
/*
 * Efm8lb12_100g_cwdm4_207.c
 *
 *  Created on: 2018-6-19
 *      Author: cuilin
 */
#include <math.h>
#include "Efm8lb12_adc.h"
#include "Efm8lb12_msa.h"
#include "Efm8lb12_smbus.h"
#include "Efm8lb12_common.h"
#include "Efm8lb12_msa_pin.h"
#include "Efm8lb12_100g_com_drv.h"

#ifdef EFM8LB12E64_100G_SFP_CWDM4_207

static uint8_t _i2c_dev_ready = 0;

static void _cwdm4_207_port0_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;
	
	P0 = P0_B0__HIGH | P0_B1__LOW | P0_B2__HIGH | P0_B3__HIGH | P0_B4__HIGH | P0_B5__LOW | P0_B6__HIGH | P0_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P0MDIN = P0MDIN_B0__ANALOG   					   // Vref
			| P0MDIN_B1__ANALOG                        // GND 
			| P0MDIN_B2__DIGITAL					   // SDA_M
			| P0MDIN_B3__DIGITAL 					   // SCL_M
			| P0MDIN_B4__DIGITAL  					   // MODSel
			| P0MDIN_B5__DIGITAL					   // LPMode
			| P0MDIN_B6__DIGITAL 					   // TXCDR INTR
			| P0MDIN_B7__ANALOG;					   // VCC


	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P0MDOUT = P0MDOUT_B0__OPEN_DRAIN
			| P0MDOUT_B1__OPEN_DRAIN 
			| P0MDOUT_B2__OPEN_DRAIN
			| P0MDOUT_B3__OPEN_DRAIN
			| P0MDOUT_B4__OPEN_DRAIN
			| P0MDOUT_B5__OPEN_DRAIN
			| P0MDOUT_B6__OPEN_DRAIN
			| P0MDOUT_B7__OPEN_DRAIN;


	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P0SKIP = P0SKIP_B0__SKIPPED
			| P0SKIP_B1__SKIPPED
			| P0SKIP_B2__NOT_SKIPPED	// SDA_M
			| P0SKIP_B3__NOT_SKIPPED	// SCL_M
			| P0SKIP_B4__SKIPPED
			| P0SKIP_B5__SKIPPED
			| P0SKIP_B6__SKIPPED
			| P0SKIP_B7__SKIPPED;

	//5. set p0MASK
	P0MASK = P0MASK_B0__IGNORED | P0MASK_B1__IGNORED | P0MASK_B2__IGNORED
			| P0MASK_B3__IGNORED | P0MASK_B4__COMPARED | P0MASK_B5__IGNORED
			| P0MASK_B6__COMPARED | P0MASK_B7__IGNORED;

	//6. set P0MAT
	P0MAT = P0MAT_B0__HIGH | P0MAT_B1__HIGH | P0MAT_B2__HIGH | P0MAT_B3__HIGH
			| P0MAT_B4__HIGH | P0MAT_B5__HIGH | P0MAT_B6__HIGH | P0MAT_B7__HIGH;

    SFRPAGE = SFRPAGE_SAVE;
}

static void _cwdm4_207_port1_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;

	P1 = P1_B0__HIGH | P1_B1__HIGH | P1_B2__HIGH | P1_B3__HIGH | P1_B4__HIGH | P1_B5__HIGH | P1_B6__HIGH | P1_B7__HIGH;

	P1MDIN = P1MDIN_B0__ANALOG		// MPD0
			| P1MDIN_B1__ANALOG		// MPD1
			| P1MDIN_B2__ANALOG		// MPD2
			| P1MDIN_B3__ANALOG		// MPD3
			| P1MDIN_B4__ANALOG		// VCC
			| P1MDIN_B5__ANALOG		// RSSI
			| P1MDIN_B6__DIGITAL	// ETS: External Temperature Sensor
			| P1MDIN_B7__DIGITAL;	// MSA INTL

	P1MDOUT = P1MDOUT_B0__OPEN_DRAIN
			| P1MDOUT_B1__OPEN_DRAIN
			| P1MDOUT_B2__OPEN_DRAIN
			| P1MDOUT_B3__OPEN_DRAIN
			| P1MDOUT_B4__OPEN_DRAIN
			| P1MDOUT_B5__OPEN_DRAIN
			| P1MDOUT_B6__PUSH_PULL
			| P1MDOUT_B7__OPEN_DRAIN;

	P1SKIP = P1SKIP_B0__SKIPPED
			| P1SKIP_B1__SKIPPED
			| P1SKIP_B2__SKIPPED
			| P1SKIP_B3__SKIPPED
			| P1SKIP_B4__SKIPPED
			| P1SKIP_B5__SKIPPED
			| P1SKIP_B6__SKIPPED
			| P1SKIP_B7__SKIPPED;

	//5. set p1MASK
	P1MASK = P1MASK_B0__IGNORED | P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
			| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
			| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;

	//6. set P1MAT
	P1MAT = P1MAT_B0__HIGH | P1MAT_B1__HIGH | P1MAT_B2__HIGH | P1MAT_B3__HIGH
			| P1MAT_B4__HIGH | P1MAT_B5__HIGH | P1MAT_B6__HIGH | P1MAT_B7__HIGH;

	SFRPAGE = SFRPAGE_SAVE;
}

static void _cwdm4_207_port2_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;
	SFRPAGE = 0x0;

	P2 = P2_B0__HIGH | P2_B1__HIGH | P2_B2__HIGH | P2_B3__HIGH | P2_B4__HIGH | P2_B5__LOW | P2_B6__HIGH ;

	P2MDIN = P2MDIN_B0__DIGITAL		// SDA_L
			| P2MDIN_B1__DIGITAL	// SCL_L
			| P2MDIN_B2__ANALOG		// Not Used
			| P2MDIN_B3__ANALOG		// Not Used
			| P2MDIN_B4__DIGITAL	// ToSA Reset
			| P2MDIN_B5__DIGITAL	// ToSA Disable
			| P2MDIN_B6__DIGITAL;	// RX Power Enable

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN
			| P2MDOUT_B1__OPEN_DRAIN
			| P2MDOUT_B2__OPEN_DRAIN
			| P2MDOUT_B3__OPEN_DRAIN
			| P2MDOUT_B4__PUSH_PULL
			| P2MDOUT_B5__PUSH_PULL
			| P2MDOUT_B6__PUSH_PULL;

	P2SKIP = P2SKIP_B0__SKIPPED
			| P2SKIP_B1__SKIPPED
			| P2SKIP_B2__SKIPPED
			| P2SKIP_B3__SKIPPED | 0x10 | 0x20 | 0x40;
//			| P2SKIP_B4__SKIPPED
//			| P2SKIP_B5__SKIPPED
//			| P2SKIP_B6__SKIPPED;

	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;

	SFRPAGE = SFRPAGE_SAVE;
}

static void _cwdm4_207_port3_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;
	SFRPAGE = 0x0;

	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;

	P3MDIN = P3MDIN_B0__DIGITAL		// TOSA/ROSA Power level adjust, not used
			| P3MDIN_B1__DIGITAL	// TX CDR LOS INTR
			| P3MDIN_B2__DIGITAL	// TOSA Power Enable
			| P3MDIN_B3__DIGITAL	// TX CDR Disable
			| P3MDIN_B4__DIGITAL;	// Not used

	P3MDOUT = P3MDOUT_B0__PUSH_PULL
			| P3MDOUT_B1__OPEN_DRAIN
			| P3MDOUT_B2__PUSH_PULL
			| P3MDOUT_B3__PUSH_PULL
			| P3MDOUT_B4__OPEN_DRAIN;

	SFRPAGE = SFRPAGE_SAVE;
}

static bool _cwdm4_207_txcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

	/*
	if(TX3V3_EN == 0)
	{
		MSA_p2_log("\r\ntxcdr is lower power mode");
		return false;
	}
	*/

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == smb_read_byte(CWDM4_207_TXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntxcdr smb read failed");
		}
		Hw_time5_delay_us(5000);
	}

	return false;
}

static bool _cwdm4_207_rxcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

