paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_207_drv.c
	/*
	if(TX3V3_EN == 0x0)
	{
		MSA_p2_log("\r\nrxcdr is lower power mode");
		return false;
	}
	*/


	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == smb_read_byte(CWDM4_207_RXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\nrxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\nrxcdr smb read failed");
		}
		Hw_time5_delay_us(5000);
	}

	return false;
}


static bool _cwdm4_207_tosa_check_exist()
{
	uint8_t i = 0, Data = 0;

	/*
	if(TX3V3_EN == 0)
	{
		MSA_p2_log("\r\ntosa is lower power mode");
		return false;
	}
	*/

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == smb_read_byte(CWDM4_207_TOSA_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntosa smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntosa smb read failed");
		}
		Hw_time5_delay_us(5000);
	}
	return false;
}

static uint8_t _cwdm4_207_txcdr_m37049_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_read_byte(CWDM4_207_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_207_txcdr_m37049_i2c_write_byte(uint8_t OffsetAddr, uint8_t Data)
{
	if((_i2c_dev_ready & TX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_write_byte(CWDM4_207_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_207_tosa_m4820_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & TOSA_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_read_byte(CWDM4_207_TOSA_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_207_tosa_m4820_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
	if((_i2c_dev_ready & TOSA_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_write_byte(CWDM4_207_TOSA_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_207_rxcdr_m37244_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if((_i2c_dev_ready & RX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_read_byte(CWDM4_207_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_207_rxcdr_m37244_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
	if((_i2c_dev_ready & RX_READY) == 0x0)
	{
		return GOS_FAIL;
	}
	return smb_write_byte(CWDM4_207_RXCDR_BASE_ADDR, OffsetAddr, Data);
}


static void _cwdm4_207_txcdr_m37049_reset()
{
	if(_cwdm4_207_txcdr_check_exist())
	{
		_i2c_dev_ready |= TX_READY;
	}

	_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_RESET,0xaa);
}
static void _cwdm4_207_tosa_m4820_reset()
{
	if(_cwdm4_207_tosa_check_exist())
	{
		_i2c_dev_ready |= TOSA_READY;
	}

	_cwdm4_207_tosa_m4820_i2c_write_byte(0x2, 0x1);  	 //tosa reset

}

static void _cwdm4_207_rxcdr_m37244_reset()
{
	if(_cwdm4_207_rxcdr_check_exist())
	{
		_i2c_dev_ready |= RX_READY;
	}

	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x02, 0xaa);
	Soft_timer_delay_ms(100);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x02, 0x00);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x03, 0xf0);
}

static void _cwdm4_207_txcdr_m37049_init()
{
	_cwdm4_207_txcdr_m37049_reset();
	_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(2),0x04);
	_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(3),0x04);
//	_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_OUTPUT_DEEMPH,0x58);
}

static uint8_t _cwdm4_207_tasa_m4820_value(uint8_t ch,SFP_DRV_LASER_CFG_T *cfg)
{
	uint8_t page;
	static code uint8_t mod_reg[][2]   = {{0x05,TOSA_PAGEN_VO1},{0x05,TOSA_PAGEN_VO2},{0x07,TOSA_PAGEN_VO1},{0x07,TOSA_PAGEN_VO2}};
	static code uint8_t cross_reg[][2] = {{0x04,TOSA_PAGEN_VO1},{0x04,TOSA_PAGEN_VO2},{0x06,TOSA_PAGEN_VO1},{0x06,TOSA_PAGEN_VO2}};


	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,ch+4);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGEN_GAIN_ADJUST,(uint8_t)cfg->bias);   //VB

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,mod_reg[ch][0]);
	_cwdm4_207_tosa_m4820_i2c_write_byte(mod_reg[ch][1],(uint8_t)cfg->mod);			//VC

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,cross_reg[ch][0]);
	_cwdm4_207_tosa_m4820_i2c_write_byte(cross_reg[ch][1],(uint8_t)cfg->cross);		//VX

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);

	return GOS_OK;
}

static void _cwdm4_207_tosa_m4820_init()
{
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_RESET,0x01);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_RESET,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x04);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x05);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x06);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x07);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x00);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_CHX_SHUTDOW,0xff);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_ADC_ENABLE_II,0xe0);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_ADC_ENABLE_II+1,0x01);
}

static void _cwdm4_207_rxcdr_m37244_init()
{
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x03,0xf0);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x19,0xff);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x1b,0x03);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x23,0xf0);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x40,0xf0);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x42,0x1e);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x43,0x1e);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x44,0x1e);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x45,0x1e);
}


void CWDM4_207_chip_reset()
{
	_cwdm4_207_txcdr_m37049_reset();
	_cwdm4_207_tosa_m4820_reset();
	_cwdm4_207_rxcdr_m37244_reset();
}

void CWDM4_207_chip_init()
{
	CWDM4_207_chip_reset();
	_cwdm4_207_txcdr_m37049_init();
	_cwdm4_207_tosa_m4820_init();
	_cwdm4_207_rxcdr_m37244_init();
}

void CWDM4_207_port_init()
{
	_cwdm4_207_port0_init();
	_cwdm4_207_port1_init();
	_cwdm4_207_port2_init();
	_cwdm4_207_port3_init();
}

int16_t  CWDM4_207_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return ((int16_t)((float)(ddmi_cali->temp) * Timer_temp_slow_boot_cal()) + ADC0_get_mcu_temp());  		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  ADC0_get_mcu_temp();  //uint: 1/256 C
	}

	return GOS_FAIL;

