paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_207_drv.c
}

uint16_t CWDM4_207_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_vcc(); //uint:0.1mv
	}
	return 0;
}

static uint16_t _cwdm4_207_get_bias_average_value()
{
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGEN_EXTERNAL_SOURCE_II,(uint8_t*)&value_l);
		_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGEN_EXTERNAL_SOURCE_II+1,(uint8_t*)&value_h);
		buff16[i] = value_l | (value_h << 8);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

static uint16_t _cwdm4_207_get_ddm_bias(uint8_t channel)
{
	uint16_t  value16 = 0;
	uint8_t page;

	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,channel+4);
	value16 = _cwdm4_207_get_bias_average_value();
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);
	return (uint16_t)((float)value16 * 0.0568);
}

uint16_t CWDM4_207_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		uint16_t bias = 0;
		float bias_temp_cali = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T	 *laser_stat = MSA_p4_get_laser_state();
		const SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		const SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		/*
		if(MSA_p67_check_apc_lut_tab(lo_cfg))  //apc paramters is invalid, so there is no need to apc calibration
		{
			const int16_t cur_temp = ADC0_get_mcu_temp();

			if(cur_temp <= (m_cfg + channel)->temp)  //low temp
			{
				bias_temp_cali = (float)(cur_temp - m_cfg->temp) / (float)TEMP_SCALE * 0.1;
			}
			else  //high temp
			{
				bias_temp_cali = (float)(cur_temp - m_cfg->temp) / (float)TEMP_SCALE * 0.56;
			}
		}
		*/

		bias  = (uint16_t)(((float)laser_stat->ch[channel].stat.txbias + ddmi_cali->current[channel].bias.bias_offset2  - ddmi_cali->current[channel].bias.bias_offset1 + bias_temp_cali) * 0.1 * 1000.0 * 0.5); //uint:2uA
		return  bias;//uint:2uA
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)((_cwdm4_207_get_ddm_bias(channel)) *10);  //0.1mA
	}
	return GOS_FAIL;
}

static uint16_t _cwdm4_207_get_rssi_average_value()
{
	uint8_t i = 0;
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		buff16[i] = ADC0_manual_poll(ADC0_RSSI0) * 0.1;   // uint:mv
		Hw_time5_delay_us(2000);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

static uint16_t cwdm4_207_ddmi_get_rssi(uint8_t channel)
{
	uint8_t value = 0, i = 0;
	uint16_t rssi_mv = 0;

	channel = 3 - channel;  //rxcdr pin is inverted sequence with qsfp28 pin

	cwdm4_207_rxcdr_m37244_i2c_read_byte(0x3, &value);
	value = SET_BIT(value,6);  //rssi enable
	if(channel == MSA_PWR_CHANNEL_1)
	{
		value = CLEAR_BIT(value,4);
		value = CLEAR_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_2)
	{
		value = SET_BIT(value,4);
		value = CLEAR_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_3)
	{
		value = CLEAR_BIT(value,4);
		value = SET_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_4)
	{
		value = SET_BIT(value,4);
		value = SET_BIT(value,5);
	}

	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x3, value);

	rssi_mv = _cwdm4_207_get_rssi_average_value();

	return (uint16_t) ((float)rssi_mv / (float)CWDM4_207_RSSI_SERIES_RES * 1000.00);
}


uint16_t CWDM4_207_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		*laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		CHECK_POWER_MIN(rxpower_result);
		CHECK_POWER_MAX(rxpower_result);
		return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  (uint16_t)cwdm4_207_ddmi_get_rssi(channel);  //uint:ua
	}

	return GOS_FAIL;
}

uint16_t CWDM4_207_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float  txmon_N = 0.0;
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, bias1 = 0.0, bias2 = 0.0;
		const DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		  *laser_stat = MSA_p4_get_laser_state();

		txmon_N =(float)laser_stat->ch[channel].stat.txpwr*0.1 ;

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		bias1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		bias2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

		if(bias1 != bias2)
		{
			txpower_result = txpower1 + (txpower1 - txpower2)/(bias1 - bias2) * (txmon_N - bias1);  //uint:mW
		}

		CHECK_POWER_MIN(txpower_result);
		CHECK_POWER_MAX(txpower_result);
		return (uint16_t)(txpower_result * 1000.0 * 10.0); //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_mpd(channel); // uint:0¨¦¨C??¡ª??¡¤mA
	}
	return 0;
}

