paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_207_drv.c
void CWDM4_207_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	_cwdm4_207_tasa_m4820_value(ch,cfg);
}

void CWDM4_207_drv_get_laser_full_state(uint8_t ch, MSA_LUT_T *lut)
{

	uint8_t page,bias, mod, cross;
	static code uint8_t mod_reg[][2]   = {{0x05,TOSA_PAGEN_VO1},{0x05,TOSA_PAGEN_VO2},{0x07,TOSA_PAGEN_VO1},{0x07,TOSA_PAGEN_VO2}};
	static code uint8_t cross_reg[][2] = {{0x04,TOSA_PAGEN_VO1},{0x04,TOSA_PAGEN_VO2},{0x06,TOSA_PAGEN_VO1},{0x06,TOSA_PAGEN_VO2}};

	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);
	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,ch + 4);
	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGEN_GAIN_ADJUST,&bias);   //VB

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,mod_reg[(ch)][0]);
	_cwdm4_207_tosa_m4820_i2c_read_byte(mod_reg[(ch)][1],&mod);			//VC

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,cross_reg[(ch)][0]);
	_cwdm4_207_tosa_m4820_i2c_read_byte(cross_reg[(ch)][1],&cross);		//VX

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);

	lut->ch[ch].config.bias = (uint16_t)bias;
	lut->ch[ch].config.mod  = (uint16_t)mod;
	lut->ch[ch].config.cross = (uint16_t)cross;

}


void CWDM4_207_drv_poll()
{
	ADC0_poll();
}

static void  cwdm4_207_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
	if(cfg->bias >= 255)
	{
		cfg->bias = 255;
	}
	if(cfg->mod >= 255)
	{
		cfg->mod = 255;
	}
	if(cfg->cross >= 255)
	{
		cfg->cross = 255;
	}
}

void CWDM4_207_drv_ch_calc_cfg(int16_t cur_temp, uint8_t ch, const SFP_DRV_LASER_CFG_T *lut, SFP_DRV_LASER_CFG_T *ret)
{
	SFP_DRV_LASER_CFG_T *lo_cfg = (lut + ch);
	SFP_DRV_LASER_CFG_T *m_cfg	= (lo_cfg + MSA_CHANNEL_NUM);
	SFP_DRV_LASER_CFG_T *hi_cfg = (m_cfg + MSA_CHANNEL_NUM);
	int16_t temp_l = 0, temp_r = 0, temp_h = 0;
	float a1 = 0.0, a2 = 0.0, a3 = 0.0;
	APC_CALI_PARAM para;

	ret->temp = cur_temp;
	ret->bias  = 0;
	ret->mod   = 0;
	ret->cross = 0;


	if(!MSA_p67_check_apc_lut_tab(lut))  //apc paramters is invalid, so there is no need to apc calibration
	{
		return;
	}

	if (cur_temp <= m_cfg->temp)
	{
		if((m_cfg->temp == lo_cfg->temp))
		{
			return;
		}

		ret->bias = (uint16_t )(floor(0.5 + (double)lo_cfg->bias +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->bias - lo_cfg->bias))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->mod = (uint16_t)(floor(0.5 + (double)lo_cfg->mod +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->mod - lo_cfg->mod))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->cross = (int16_t)(floor((double)lo_cfg->cross +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->cross - lo_cfg->cross)
						/ ((double)(m_cfg->temp - lo_cfg->temp)))));
	}
	else
	{
		if(lo_cfg->temp == m_cfg->temp || lo_cfg->temp == hi_cfg->temp || m_cfg->temp == hi_cfg->temp)
		{
			return;
		}

		temp_l = lo_cfg->temp / TEMP_SCALE;
		temp_r = m_cfg->temp  / TEMP_SCALE;
		temp_h = hi_cfg->temp / TEMP_SCALE;

		a1 = (double)lo_cfg->bias /((double)(temp_l - temp_r) * (double)(temp_l - temp_h));
		a2 = (double)m_cfg->bias  /((double)(temp_r - temp_l) * (double)(temp_r - temp_h));
		a3 = (double)hi_cfg->bias /((double)(temp_h - temp_l) * (double)(temp_h - temp_r));

		//MSA_p2_log("\r\n a1= %f,a2 = %f, a3= %f",a1,a2,a3);

		para.a = a1 + a2 + a3;
		para.b = -a1 * (double)(temp_r + temp_h) - a2 * (double)(temp_l + temp_h) - a3 * (double)(temp_l + temp_r);
		para.c = a1 * (double)(temp_r) * (double)(temp_h) + a2 * (double)(temp_l) * (double)(temp_h) + a3 * (double)(temp_l) * (double)(temp_r);
		ret->bias = (uint16_t)(floor(0.5 + (para.a * pow((float)(cur_temp/TEMP_SCALE), 2.0) + para.b * (float)(cur_temp/TEMP_SCALE) + para.c)));

		//MSA_p2_log("\r\n a= %f,b = %f, c= %f, bias = %hd",para.a, para.b, para.c, ret->bias);

		ret->mod = (uint16_t)(floor((double)m_cfg->mod +
							((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->mod - m_cfg->mod)/ (hi_cfg->temp - m_cfg->temp))));
		ret->cross = (int16_t)(floor((double)m_cfg->cross +
							((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->cross - m_cfg->cross)/(hi_cfg->temp - m_cfg->temp))));

		//MSA_p2_log("\r\n bias= %hd,mod = %hd",ret->bias, ret->mod);

	}

	cwdm4_207_drv_check_laser_ch(ret);
	return ;

}

MSA_INTR_STATUS_T *CWDM4_207_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint8_t value = 0, ts = 0;

	if(intr_mask & PORT_INTR_TX_FAULT)
	{
		_cwdm4_207_txcdr_m37049_i2c_read_byte(M3704X_LOL_OR_LOS_LOS_STATUS, &value);  //get tx fault
		status.tx_fault = value & 0x0F;
	}

	if(intr_mask & PORT_INTR_TX_LOS)
	{
		_cwdm4_207_txcdr_m37049_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get tx los
		status.tx_los = value & 0x0F;
	}

	if(intr_mask & PORT_INTR_TX_LOL)
	{
		_cwdm4_207_txcdr_m37049_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get tx lol
		status.tx_lol = (value & 0xF0) >> 4;
	}

	if(intr_mask & PORT_INTR_RX_LOL)
	{
		_cwdm4_207_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx lol
		status.rx_lol = REVERSE_LSB_4BITS(((value & 0xF0) >> 4));
	}

	if(intr_mask & PORT_INTR_RX_LOS)
	{
		_cwdm4_207_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx los
		status.rx_los = REVERSE_LSB_4BITS(value & 0x0F);
	}
	return &status;
}

//MSA Lower Page byte86 for tx disable
void CWDM4_207_set_tx_enable(uint8_t enale)
{
	uint8_t value = 0,page;
//	enale = REVERSE_LSB_4BITS(enale);
	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,&page);

	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0);
	value = (enale&0x01)|((enale&0x02)<<1)|((enale&0x04)<<2)|((enale&0x08)<<3);
	value = ~((value<<1)|value);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_CHX_SHUTDOW,value);
	_cwdm4_207_tosa_m4820_i2c_read_byte(TOSA_PAGE0_CHX_SHUTDOW,&value);
	value = ~(value&0x01)|((value&0x02)>>1)|((value&0x04)>>2)|((value&0x08)>>3);
	_cwdm4_207_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);
}

