paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_207_drv.c
//MSA Lower Page byte93 for power override
void CWDM4_207_set_low_power(uint8_t enable)
{
	if(enable)
	{
		MSA_set_low_power_mode(0);
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		//TX3V3_EN = 0;  //close tx3v3 in order to realize low power mode
		TX3V3_EN = 0;
		RX3V3_EN = 0;
		TOSA_RST = 0;
		TX_DIS = 1;
		SDA_M = 0; 	//make SDA_M = 0 to prevent mcu provide voltage to cdr chip
		SCL_M = 0;
	}
	else
	{
		MSA_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;
		//TX3V3_EN = 1; //open tx3v3 in order to realize high power mode
		TX3V3_EN = 1;
		RX3V3_EN = 1;
		TOSA_RST = 1;
		TX_DIS = 0;
		SDA_M = 1;
		SCL_M = 1;
	}
}

//MSA Lower Page byte98 for tx and rx cdr control
void CWDM4_207_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0,channel;

	//msa value is reverse with cdr value
	tx_cdr_control = ~(((value) & 0xF0) >> 4);
	rx_cdr_control = REVERSE_LSB_4BITS(~((value) & 0x0F));

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel++)
	{
		_cwdm4_207_txcdr_m37049_i2c_read_byte(M3704X_MODE_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 5) | (GET_BIT(tx_cdr_control, channel) << 5);
		_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(channel),tmp);
	}

	_cwdm4_207_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| rx_cdr_control;
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x10, tmp);  //set rx cdr control
}

//MSA Page3 byte234 and byte235 for tx eq
void CWDM4_207_set_tx_eq(uint8_t channel, uint8_t value)
{
	uint8_t eq_table[11] = {0,0,1,2,2,3,4,4,4,6,7};
	if(value != 0xff)
	{
		value = (eq_table[value & 0x0f]) << 4;
	}
	else
	{
		value = 0x50;
	}

	_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_SLA_CH(channel),value);
}

//MSA Page3 byte236 and byte237 for rx emphasis
void CWDM4_207_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x46, 0x46,0x47,0x47};
	uint8_t rx_emphasis[] = {0x0, 0x3, 0x5, 0x7,0x9, 0xb, 0xd, 0xf};
	uint8_t tmp = 0;

	if(value > RX_EMPHASIS_MAX_VALID)
	{
		return ;
	}

	//rx channel reverse
	channel = 3 - channel;

	_cwdm4_207_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp); //rxcdr pin is inverted sequence with qsfp28 pin

	if(channel == 0x0 || channel == 0x2)
	{
		value = CLEAR_LSB_4BITS(tmp) | rx_emphasis[value];
	}
	else if(channel == 0x1 || channel == 0x3)
	{
		value = CLEAR_MSB_4BITS(tmp) | (rx_emphasis[value] << 4);
	}

	_cwdm4_207_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);//rxcdr pin is inverted sequence with qsfp28 pin
}

//MSA Page3 byte238 and byte239 rx amplitude
//0x3 900  --0x3c
//0x2 600  --0x1e
//0x1 450  --0x0f
//0x0 250  --0x00
void CWDM4_207_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x42,0x43,0x44,0x45};
	uint8_t rx_amplitude[] = {0x00, 0x0f, 0x1e, 0x3c};
	uint8_t tmp = 0;

	if(value > RX_AMPLITUDE_MAX_VALID)
	{
		return;
	}

	//rx channel reverse, rxcdr pin is inverted sequence with qsfp28 pin
	channel = 3 - channel;

	_cwdm4_207_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp);

	value = (tmp & 0xC0) | rx_amplitude[value];

	_cwdm4_207_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);
}


//MSA Page3 byte240 sq disable
void CWDM4_207_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tmp = 0,channel, rx_sq = 0, tx_sq = 0;

	//rx channel reverse
	rx_sq  = REVERSE_LSB_4BITS((value & 0xF0) >> 4);
	tx_sq  = (value & 0x0F);

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel++)
	{
		_cwdm4_207_txcdr_m37049_i2c_read_byte(M3704X_OUTPUT_SWING_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 7) | (GET_BIT(tx_sq, channel) << 7);
		_cwdm4_207_txcdr_m37049_i2c_write_byte(M3704X_OUTPUT_SWING_CH(channel),tmp);
	}

	_cwdm4_207_rxcdr_m37244_i2c_read_byte(0x40,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_sq << 4);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x40, tmp);  //set rx cdr control

}

//MSA Page3 byte241 for rx output disable
void CWDM4_207_set_rx_output_disable(uint8_t value)
{
	uint8_t rx_output_disable = 0,  tmp = 0;

	//rx channel reverse
	rx_output_disable = REVERSE_LSB_4BITS((value & 0xF0) >> 4);

	_cwdm4_207_rxcdr_m37244_i2c_read_byte(0x10, &tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_output_disable << 4);
	_cwdm4_207_rxcdr_m37244_i2c_write_byte(0x10, tmp);
}

//MSA Page3 byte241 for tx adapt eq
void  CWDM4_207_set_tx_adapt_eq(uint8_t value1, uint8_t value2,uint8_t value3)
{
	uint8_t tmp = 0, tx_adapt_eq = 0,channel;

	tx_adapt_eq = (value1 & 0x0F);

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel ++)
	{
		if(GET_BIT(tx_adapt_eq, channel) == 0x1)
		{
			CWDM4_207_set_tx_eq(channel,0xff);
		}
		else
		{
			if(channel >= 0x0 && channel < 0x2)
			{
				tmp = ((value2) >> (4 * ((channel + 1) % 2)))& 0x0f;
			}
			else if(channel >= 0x2 && channel < MSA_CHANNEL_NUM)
			{
				tmp = ((value3) >> (4 * ((channel + 1) % 2)))& 0x0f;
			}
			CWDM4_207_set_tx_eq(channel,tmp& 0x0f);
		}
	}
}

#endif
